[
  {
    "id": 40259,
    "title": "The SCOOP on Managing Stress",
    "slug": "the-scoop-on-managing-stress",
    "link": "https://steppingstonescri.net/the-scoop-on-managing-stress/",
    "excerpt": "",
    "date": "2020-08-03T17:00:09",
    "categories": [
      7
    ],
    "content": "<p><img decoding=\"async\" loading=\"lazy\" src=\"https://mco.eastpointe.net/DocumentBrowser/Media-Library/SCOOP-Hope4NC_INSTA.jpg\" /></p>\n"
  },
  {
    "id": 37653,
    "title": "Today We Celebrate Juneteenth",
    "slug": "today-we-celebrate-juneteenth",
    "link": "https://steppingstonescri.net/today-we-celebrate-juneteenth/",
    "excerpt": "[vc_row][vc_column][vc_custom_heading text=&#8221;Juneteenth Celebrates the End of Slavery in the United States 155 Years Ago Today&#8221; font_container=&#8221;tag:h2|text_align:center|color:%2381d742&#8243; google_fonts=&#8221;font_family:Droid%20Sans%3Aregular%2C700|font_style:700%20bold%20regular%3A700%3Anormal&#8221;][vc_column_text]\nIt is also known as Emancipation Day, Juneteenth Independence Day, and Black Independence Day. On June 19, 1865, Major General Gordon Granger arrived in Galveston, TX, and announced the end of the Civil War and the end of slavery. Although the Emancipation Proclamation came 2½ years earlier on January 1, 1863, many slave owners continued to hold their slaves captive after the announcement, &#8230;",
    "date": "2020-06-19T18:10:33",
    "categories": [
      7
    ],
    "content": "<div class=\"wpb-content-wrapper\">[vc_row][vc_column][vc_custom_heading text=&#8221;Juneteenth Celebrates the End of Slavery in the United States 155 Years Ago Today&#8221; font_container=&#8221;tag:h2|text_align:center|color:%2381d742&#8243; google_fonts=&#8221;font_family:Droid%20Sans%3Aregular%2C700|font_style:700%20bold%20regular%3A700%3Anormal&#8221;][vc_column_text]</p>\n<h3><strong>It is also known as Emancipation Day, Juneteenth Independence Day, and Black Independence Day. On June 19, 1865, Major General Gordon Granger arrived in Galveston, TX, and announced the end of the Civil War and the end of slavery. Although the Emancipation Proclamation came 2½ years earlier on January 1, 1863, many slave owners continued to hold their slaves captive after the announcement, so Juneteenth became a symbolic date representing African American freedom.</strong></h3>\n<h3><strong>#BlackLivesMatter</strong></h3>\n<p>&nbsp;</p></div>\n"
  },
  {
    "id": 10772,
    "title": "Information Concerning Alcohol and Driving While Impaired",
    "slug": "information-concerning-alcohol-and-driving-while-impaired",
    "link": "https://steppingstonescri.net/information-concerning-alcohol-and-driving-while-impaired/",
    "excerpt": "There are five levels of misdemeanor Driving While Intoxicated. Level I is the most serious and Level V the least.\nLevel V\nPunishable by a fine up to $200 and a minimum jail sentence of 24 hours and a maximum of 60 days. A judge can suspend the sentence but upon completion that the driver spend 24 hours in jail, perform 24 hours of community service or not operate a vehicle for 30 days.\nLevel IV\nPunishable by a &#8230;",
    "date": "2017-07-26T17:54:58",
    "categories": [
      7
    ],
    "content": "<p><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/07/DWI-Penalties.jpg\"><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter  wp-image-10773\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/07/DWI-Penalties.jpg\" alt=\"\" width=\"146\" height=\"146\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2017/07/DWI-Penalties.jpg 250w, https://steppingstonescri.net/wp-content/uploads/2017/07/DWI-Penalties-150x150.jpg 150w, https://steppingstonescri.net/wp-content/uploads/2017/07/DWI-Penalties-71x71.jpg 71w, https://steppingstonescri.net/wp-content/uploads/2017/07/DWI-Penalties-36x36.jpg 36w, https://steppingstonescri.net/wp-content/uploads/2017/07/DWI-Penalties-180x180.jpg 180w\" sizes=\"auto, (max-width: 146px) 100vw, 146px\" /></a></p>\n<h3 style=\"text-align: center;\"><strong>There are five levels of misdemeanor Driving While Intoxicated. Level I is the most serious and Level V the least.</strong></h3>\n<p>Level V</p>\n<p>Punishable by a fine up to $200 and a minimum jail sentence of 24 hours and a maximum of 60 days. A judge can suspend the sentence but upon completion that the driver spend 24 hours in jail, perform 24 hours of community service or not operate a vehicle for 30 days.</p>\n<p>Level IV</p>\n<p>Punishable by a fine up to $500 and a minimum jail sentence of 48 hours and a maximum of 120 days. A judge can suspend the sentence but upon completion that the driver spend 48 hours in jail, perform 48 hours of community service or not operate a vehicle for 60 days.</p>\n<p>Level III</p>\n<p>Punishable by a fine up to $1,000 and a minimum jail sentence of 72 hours and a maximum of six months. A judge can suspend the sentence only upon completion that the driver spend at least 72 hours in jail, perform 72 hours of community service or not operate a vehicle for 90 days.</p>\n<p>Level II</p>\n<p>Punishable by a fine up to $2,000 and a minimum jail sentence of seven days and a maximum of one year. A judge CANNOT suspend the minimum sentence.</p>\n<p>Level I</p>\n<p>Punishable by a fine up to $4,000 and a minimum jail sentence of 30 days and a maximum of two years. A judge CANNOT suspend the minimum sentence.</p>\n<p>Level I and II drivers are repeat offenders, persons whose license are revoked, impaired drivers, impaired drivers who are transporting young children and impaired drivers who hurt someone in a crash. Impaired drivers must complete a substance abuse assessment and comply with any recommended treatment as a condition for having their drivers license restored at the end of the revocation period.</p>\n<p>Felony DWI</p>\n<p>For Habitual DWI offenders, drivers who have had three prior DWI convictions within the past seven years, DWI becomes a more severe felony. But more importantly, the Habitual DWI statute now mandates a minimum active jail term of one year &#8212; a sentence that CANNOT be suspended. Offenders must also go through a substance abuse program while in jail or as a condition of parole.</p>\n<p>Seizure and Forfeiture of Vehicles</p>\n<p>The Governor&#8217;s DWI Initiative takes away from repeat DWI offenders the means to drive while impaired; namely, their cars. Under the new provision, a law enforcement officer can seize a driver&#8217;s car if the officer charges that person with DWI and that person was driving while his or her license was revoked due to a previous impaired driving offense. The seizure happens at the time of the arrest and NOT after the case has come to trial.</p>\n<p>If a court convicts the driver of DWI and of committing the offense while driving with a revoked license due to a previous impaired driving offense, the judge will order the vehicle forfeited. The school board can then sell the vehicle and keep the proceeds, sharing the money with any other school systems in the county, or keep the car for its own use. The law does allow vehicle owners to get their cars back if they were not the driver convicted of DWI but only if they satisfy the court that they are an innocent party.</p>\n<p>Zero Tolerance for Commercial Motor Vehicle Drivers</p>\n<p>It&#8217;s unlawful for the operator of a commercial motor vehicle to drink and drive. The first offense results in a 10 day disqualification to operate a commercial motor vehicle. The second or subsequent offense revokes the drivers license to operate any vehicle.</p>\n<p>Zero tolerance for school bus and school activity bus drivers and child care vehicle drivers.</p>\n<p>It is unlawful for school bus and school activity bus drivers and child care vehicle operators (day care van etc.) to drink and drive.</p>\n<p>Offenders Under Age 21</p>\n<p>Prior to the enactment of the new statutes, North Carolina had already taken a zero-tolerance stance against drivers who were under the legal drinking age who nevertheless drank or used drugs illegally and then got behind the wheel. People under age 21 simply cannot drive with any alcohol or illegally-used drugs in their systems &#8212; period. Any amount of alcohol will result in an immediate 30 day pretrial revocation. If an underage drinking driver refuses to take such a test, he or she now need only have the smell of alcohol on the breath to be convicted of driving after drinking. Offenders will have their licenses revoked for one year but can get limited driving privileges instated by a judge if the driver was at least 18 years old at the time of the offense and did not have a prior conviction.</p>\n<p>Drug Testing</p>\n<p>The Initiative also recognized North Carolina&#8217;s inability to prosecute and convict someone for driving while impaired by something other than alcohol. Under the new provision, law officers can now order chemical tests for drugs. It also amends the old law to allow for the revocation of a driver&#8217;s license if he or she refuses to take such a test.</p>\n<p>Drivers License Revocation</p>\n<p>All persons charged with DWI who refuse to take an Intoxilyzer test or has results of 0.08 or more, 0.04 if commercial motor vehicle, or under age 21 and the results are above 0.04, will have their license revoked immediately for 30 days. There is a limited driving privilege available after 10 days. Upon conviction of DWI for first offense, the license is revoked for one year. A limited driving privilege may be granted by the judge, but only if the driver did not hurt anyone, did not have a child under sixteen years of age in the car at the time of the drunk driving, and the driver obtains a substance abuse assessment. In order to have a license restored at the end of one year, the driver must go to treatment or school as recommended by the assessment. Upon conviction of a second offense within three years, the revocation is four years.</p>\n<p>Refusing a Test</p>\n<p>A driver who is stopped by a Trooper or other officer for certain alcohol-related offenses will be requested to submit to a breath test or blood test or both to determine alcohol concentration or the presence of drugs in the blood. The results of the test will be used in court.</p>\n<p>If the driver refuses the test, an immediate 30-day revocation is imposed and an additional one-year revocation is imposed after an opportunity for a hearing.</p>\n<p>Even if the driver is found not guilty of DWI in court, the one-year revocation is imposed for refusing the test.</p>\n<p>A limited driving privilege may be granted but only after a six-month revocation period.</p>\n<p>History</p>\n<p>Before 1999, North Carolina already had some of the strictest drinking and driving statutes ever adopted in the United States. The Governor&#8217;s DWI Initiative has made those regulations even tougher.</p>\n<p>In December, 1998, the cars of repeat offenders are being seized and sold with the money given to the local school system. In excess of 8,000 vehicles have been seized since then. Starting in the year 2000 any person who is convicted of DWI and has their drivers license reinstated will not be able to drink and drive. Instead of an alcohol concentration of 0.08, these drivers will lose their license if they have limits of 0.04 or higher, depending upon their driving record and if they were charged and convicted after 1 July 2001. An ignition interlock system where the car will not start if the driver has been drinking will be required for some repeat offenders. The repeat offenders are being targeted and for good reason.</p>\n<p>In 1998, 469 people died in alcohol-related crashes on North Carolina highways. Another 10,629 were injured. The North Carolina State Highway Patrol arrested nearly 40,000 people for driving while impaired (DWI) in 1998 and more than 43,000 the year before that. The combined DWI arrests for all law enforcement agencies in North Carolina totaled nearly 80,000 for each of those two years, respectively. Though they pale in comparison to the human loss, the financial costs in lawyer fees, court costs, fines, increased insurance rates, and the like to a person convicted of DWI are also great. They range from $6,000 to $8,000 over three years. The bottom line: Never drive after drinking any amount of alcohol!</p>\n<p>In North Carolina, it is illegal to drive a vehicle while noticeably impaired or with an alcohol concentration of 0.08 or higher. When driving a commercial motor vehicle, the limit is 0.04. The most significant aspects of the state&#8217;s new DWI law make punishment more severe for the impaired driver in general and the repeat offender in particular.</p>\n<p>This information was obtained at <a href=\"https://www.ncdps.gov\">https://www.ncdps.gov</a></p>\n<p>&nbsp;</p>\n"
  },
  {
    "id": 10754,
    "title": "Know! The Effect of Peer Presence",
    "slug": "know-the-effect-of-peer-presence",
    "link": "https://steppingstonescri.net/know-the-effect-of-peer-presence/",
    "excerpt": "NC Parent Resource Center\nbrings you\nKnow!\nTalking regularly with kids about the dangers of alcohol,\ntobacco and other drugs to reduce their risk of using.\nKnow! The Effect of Peer Presence\nWe all know the heavy influence peer pressure can have on a tween/teen, especially when it comes to risk-taking behaviors like drinking, smoking and using other drugs. But are you aware of the impact the mere presence of peers can have on an adolescent’s decision-making, &#8230;",
    "date": "2017-07-19T15:55:17",
    "categories": [
      7
    ],
    "content": "<h1><img decoding=\"async\" loading=\"lazy\" src=\"http://staticapp.icpsc.com/icp/loadimage.php/mogile/918858/27ef31dbb7bbbaef6ad0fe404668d429/image/jpeg\" /></h1>\n<h1></h1>\n<h1></h1>\n<h1 style=\"text-align: center;\"><a href=\"http://www.ncparentresourcecenter.org/\"><strong>NC Parent Resource Center</strong></a></h1>\n<p style=\"text-align: center;\"><strong>brings you</strong></p>\n<h1 style=\"text-align: center;\"><strong>Know!</strong></h1>\n<h3 style=\"text-align: center;\"><strong>Talking regularly with kids about the dangers of alcohol,<br />\ntobacco and other drugs to reduce their risk of using.</strong></h3>\n<h1></h1>\n<h1 style=\"text-align: center;\">Know! The Effect of Peer Presence</h1>\n<p>We all know the heavy influence peer pressure can have on a tween/teen, especially when it comes to risk-taking behaviors like drinking, smoking and using other drugs. But are you aware of the impact the mere presence of peers can have on an adolescent’s decision-making, without any coercing or encouragement at all?</p>\n<p>Psychologists from Temple University were curious to know why it is that otherwise good kids seem to make poor decisions when they are among their peers. In seeking an answer to this question, they used functional magnetic resonance imaging (fMRI) scans on teens, college students and adults to determine if there are differences in brain activity when making decisions alone versus with their friends. What they found is that, “teen peer pressure has a distinct effect on brain signals involving risk and reward,” which may explain in part why youth are at greater risk for bad behavior when their friends are watching.</p>\n<p>To test how the presence of peers influences risk-taking, the researchers had the various age groups individually engage in a simulated driving game, where the goal was to reach the finish line as quickly as possible, offering cash prizes as incentive. The participants had to make decisions about obeying traffic signals; they could, for instance, slow down as they approached a yellow light and get delayed, or race through it and risk crashing, which would cause an even longer delay. The youth and adults each played four rounds, half of which they played alone.</p>\n<p>Among the adults and college students, there was no significant difference in the decisions they made regardless of friends watching or not. However, the teens ran about 40 percent more yellow lights and had 60 percent more crashes when they knew their friends were watching. The part of the brain that is associated with reward activity also increased in teens when they knew their friends were watching. In other words, the typical teenage brain seems to view it as high risk = high reward.</p>\n<p>Laurence Steinberg Ph.D., an author of the study and psychology professor at Temple University says these findings give a new view on peer pressure, since their peers were not even in the same room as the participants. Simply knowing their friends were watching caused the teens to take risks they otherwise would not have taken on their own.</p>\n<p>It is important to know that while the brain reaches maximum size between ages 12 – 14, it continues to grow and develop through a person’s early 20’s. One of the last brain regions to mature is the prefrontal cortex; the control center for looking ahead and sizing up risks and rewards. The limbic system (which is responsible for emotional responses) however, develops earlier. The relationship between the already developed emotional center alongside the under-developed self-control center sheds light on why teens act on emotion before thinking it through.</p>\n<p>While this study was only virtual, it falls in line with real-world data that shows that car accidents among young drivers increase when other teens are in the car. But this study is not just about teens making decisions behind the wheel. Dr. Steinberg says it is about parents needing to be aware that groups of teens need close supervision.</p>\n<p>“All of us who have very good kids know they’ve done really dumb things when they’ve been with their friends,” Dr. Steinberg said. “The lesson is that if you have a kid whom you think of as very mature and able to exercise good judgment, based on your observations when he or she is alone or with you, that doesn’t necessarily generalize to how he or she will behave in a group of friends without adults around. Parents should be aware of that.”</p>\n<p>Sources:</p>\n<p><a href=\"http://click.icptrack.com/icp/rclick.php?d=44Yw5JSo_nk3ufSGFqZY1KPqY3VIGrKE&amp;w=4&amp;destination=https%3A%2F%2Fwww.psychologytoday.com%2Fblog%2Fyou-and-your-adolescent%2F201102%2Fhow-peers-affect-the-teenage-brain\">Psychology Today. Laurence Steinberg Ph.D.: You and Your Adolescent &#8211; How Peers Affect the Teenage Brain. Posted Feb 03, 2011</a>. <a href=\"http://click.icptrack.com/icp/rclick.php?d=44Yw5JSo_nk3ufSGFqZY1KPqY3VIGrKE&amp;w=4&amp;destination=http%3A%2F%2Fheadsup.scholastic.com%2Fsites%2Fdefault%2Ffiles%2FNIDA6-INS4_Stu_Mag.pdf\">From Scholastic and the Scientists of the National Institute on Drug Abuse, National Institutes of Health, The U.S. Department of Health and Human Services: Teens and Decision Making: What Brain Science Reveals</a></p>\n<p style=\"text-align: center;\"><strong>Know!</strong> is a program of <a href=\"https://preventionactionalliance.org/\">Drug Free Action Alliance</a></p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter\" src=\"http://staticapp.icpsc.com/icp/loadimage.php/mogile/918858/b2f678abe59b50d3b4b619d9bb55bc8e/image/jpeg\" /></p>\n<p style=\"text-align: center;\">Know! Funding support by:</p>\n<p align=\"center\">Drug Free Action Alliance<br />\n6155 Huntley Rd.<br />\nColumbus, Ohio 43229</p>\n<p align=\"center\"><img decoding=\"async\" loading=\"lazy\" src=\"http://staticapp.icpsc.com/icp/loadimage.php/mogile/918858/00622948d8e93f26e256c2da557d6202/image/jpeg\" /></p>\n<p style=\"text-align: center;\">For information about the NC Parent Resource Center visit:</p>\n<p style=\"text-align: center;\"><a href=\"http://www.ncparentresourcecenter.org\">www.ncparentresourcecenter.org</a></p>\n<p>&nbsp;</p>\n"
  },
  {
    "id": 10639,
    "title": "Stepping Stones attends the NC Substance Abuse Prevention Conference",
    "slug": "stepping-stones-attends-the-nc-substance-abuse-prevention-conference",
    "link": "https://steppingstonescri.net/stepping-stones-attends-the-nc-substance-abuse-prevention-conference/",
    "excerpt": "Stepping Stones Community Resources exhibited and attended the 13 Annual North Carolina Substance Abuse Prevention Conference, May 2-3, 2017 at the McKimmon Conference and Training Center in Raleigh NC.\nThis conference covered so many issues facing North Carolina. Some of the topics discussed were:\n&#8220;What is Big Marijuana and Where Are We Going with Pot Policy in the US?&#8221;\n&#8220;Statewide Collaboration Increases the Impact of Prevention&#8221;\n&#8220;Is Childhood Adversity the Real Gateway Drug?&#8221;\n&#8220;Everything You Need to Know About Recovery &#8230;",
    "date": "2017-05-04T17:01:42",
    "categories": [
      7
    ],
    "content": "<p><strong>Stepping Stones Community Resources exhibited and attended the 13 Annual North Carolina Substance Abuse Prevention Conference, May 2-3, 2017 at the McKimmon Conference and Training Center in Raleigh NC.</strong></p>\n<p>This conference covered so many issues facing North Carolina. Some of the topics discussed were:</p>\n<p>&#8220;What is Big Marijuana and Where Are We Going with Pot Policy in the US?&#8221;</p>\n<p>&#8220;Statewide Collaboration Increases the Impact of Prevention&#8221;</p>\n<p>&#8220;Is Childhood Adversity the Real Gateway Drug?&#8221;</p>\n<p>&#8220;Everything You Need to Know About Recovery High Schools&#8221;</p>\n<p>On the first day of the conference, The Honorable Josh Stein, Attorney General of North Carolina, spoke on &#8220;Confronting the Opioid Epidemic in North Carolina&#8221;. In addition, Erin J. Day, BA, BS, Director of the Wilson County Substance Abuse Coalition, presented a breakout session on &#8220;Rx Media Campaign: Through the Local Looking Glass&#8221;.</p>\n<p>A very informative and thought-provoking conference.</p>\n<p><em><strong>Here are some pictures from the event:</strong></em></p>\n<div id=\"attachment_10656\" style=\"width: 205px\" class=\"wp-caption alignleft\"><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/SSCRI-Table4.jpg\"><img decoding=\"async\" aria-describedby=\"caption-attachment-10656\" loading=\"lazy\" class=\" wp-image-10656\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/SSCRI-Table4-300x225.jpg\" alt=\"\" width=\"195\" height=\"146\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table4-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table4-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table4-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 195px) 100vw, 195px\" /></a></p>\n<p id=\"caption-attachment-10656\" class=\"wp-caption-text\">Stepping Stones Partners: Healthy Start Medical Transportation and Spread Seeds (non-profit)</p>\n</div>\n<div id=\"attachment_10640\" style=\"width: 253px\" class=\"wp-caption alignleft\"><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/SSCRI-Table.jpg\"><img decoding=\"async\" aria-describedby=\"caption-attachment-10640\" loading=\"lazy\" class=\" wp-image-10640\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/SSCRI-Table-300x225.jpg\" alt=\"\" width=\"243\" height=\"182\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 243px) 100vw, 243px\" /></a></p>\n<p id=\"caption-attachment-10640\" class=\"wp-caption-text\">Stepping Stones Community Resource Exhibit</p>\n</div>\n<div id=\"attachment_10657\" style=\"width: 158px\" class=\"wp-caption alignleft\"><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/SSCRI-Table5.jpg\"><img decoding=\"async\" aria-describedby=\"caption-attachment-10657\" loading=\"lazy\" class=\" wp-image-10657\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/SSCRI-Table5-225x300.jpg\" alt=\"\" width=\"148\" height=\"198\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table5-225x300.jpg 225w, https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table5-768x1024.jpg 768w\" sizes=\"auto, (max-width: 148px) 100vw, 148px\" /></a></p>\n<p id=\"caption-attachment-10657\" class=\"wp-caption-text\">Stepping Stones DWI Services</p>\n</div>\n<div id=\"attachment_10655\" style=\"width: 179px\" class=\"wp-caption alignright\"><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/SSCRI-Table3.jpg\"><img decoding=\"async\" aria-describedby=\"caption-attachment-10655\" loading=\"lazy\" class=\" wp-image-10655\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/SSCRI-Table3-225x300.jpg\" alt=\"\" width=\"169\" height=\"226\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table3-225x300.jpg 225w, https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table3-768x1024.jpg 768w\" sizes=\"auto, (max-width: 169px) 100vw, 169px\" /></a></p>\n<p id=\"caption-attachment-10655\" class=\"wp-caption-text\">Stepping Stones Primary Care</p>\n</div>\n<div id=\"attachment_10654\" style=\"width: 219px\" class=\"wp-caption alignleft\"><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/SSCRI-Table2.jpg\"><img decoding=\"async\" aria-describedby=\"caption-attachment-10654\" loading=\"lazy\" class=\" wp-image-10654\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/SSCRI-Table2-300x225.jpg\" alt=\"\" width=\"209\" height=\"157\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table2-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table2-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2017/05/SSCRI-Table2-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 209px) 100vw, 209px\" /></a></p>\n<p id=\"caption-attachment-10654\" class=\"wp-caption-text\">Stepping Stones Substance Abuse and Behavioral/Mental Health Services</p>\n</div>\n<div id=\"attachment_10650\" style=\"width: 229px\" class=\"wp-caption alignleft\"><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/NC-Parent-Resource-Center.jpg\"><img decoding=\"async\" aria-describedby=\"caption-attachment-10650\" loading=\"lazy\" class=\" wp-image-10650\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/NC-Parent-Resource-Center-300x225.jpg\" alt=\"\" width=\"219\" height=\"164\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2017/05/NC-Parent-Resource-Center-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2017/05/NC-Parent-Resource-Center-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2017/05/NC-Parent-Resource-Center-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 219px) 100vw, 219px\" /></a></p>\n<p id=\"caption-attachment-10650\" class=\"wp-caption-text\">Exhibitor and Presenter of the Conference: NC Parent Resource Center</p>\n</div>\n<div id=\"attachment_10653\" style=\"width: 216px\" class=\"wp-caption alignnone\"><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/Networking-Break.jpg\"><img decoding=\"async\" aria-describedby=\"caption-attachment-10653\" loading=\"lazy\" class=\" wp-image-10653\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/Networking-Break-300x225.jpg\" alt=\"\" width=\"206\" height=\"154\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2017/05/Networking-Break-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2017/05/Networking-Break-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2017/05/Networking-Break-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 206px) 100vw, 206px\" /></a></p>\n<p id=\"caption-attachment-10653\" class=\"wp-caption-text\">Networking Break with Exhibitors</p>\n</div>\n<div id=\"attachment_10643\" style=\"width: 221px\" class=\"wp-caption alignnone\"><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/Breakout-Session.jpg\"><img decoding=\"async\" aria-describedby=\"caption-attachment-10643\" loading=\"lazy\" class=\" wp-image-10643\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/Breakout-Session-300x225.jpg\" alt=\"\" width=\"211\" height=\"158\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2017/05/Breakout-Session-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2017/05/Breakout-Session-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2017/05/Breakout-Session-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 211px) 100vw, 211px\" /></a></p>\n<p id=\"caption-attachment-10643\" class=\"wp-caption-text\">Breakout Session</p>\n</div>\n<div id=\"attachment_10642\" style=\"width: 217px\" class=\"wp-caption alignnone\"><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/Attendees-at-Lunch-Session.jpg\"><img decoding=\"async\" aria-describedby=\"caption-attachment-10642\" loading=\"lazy\" class=\" wp-image-10642\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/Attendees-at-Lunch-Session-300x225.jpg\" alt=\"\" width=\"207\" height=\"155\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2017/05/Attendees-at-Lunch-Session-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2017/05/Attendees-at-Lunch-Session-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2017/05/Attendees-at-Lunch-Session-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 207px) 100vw, 207px\" /></a></p>\n<p id=\"caption-attachment-10642\" class=\"wp-caption-text\">Luncheon Session</p>\n</div>\n<div id=\"attachment_10652\" style=\"width: 220px\" class=\"wp-caption alignleft\"><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/NC-Substance-Abuse-Providers-Association.jpg\"><img decoding=\"async\" aria-describedby=\"caption-attachment-10652\" loading=\"lazy\" class=\" wp-image-10652\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2017/05/NC-Substance-Abuse-Providers-Association-300x225.jpg\" alt=\"\" width=\"210\" height=\"157\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2017/05/NC-Substance-Abuse-Providers-Association-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2017/05/NC-Substance-Abuse-Providers-Association-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2017/05/NC-Substance-Abuse-Providers-Association-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 210px) 100vw, 210px\" /></a></p>\n<p id=\"caption-attachment-10652\" class=\"wp-caption-text\">Exhibitor: NC Substance Abuse Providers Association</p>\n</div>\n"
  },
  {
    "id": 10314,
    "title": "Stepping Stones attends the Wilson NC Recovery Rally",
    "slug": "stepping-stones-attends-the-wilson-nc-recovery-rally",
    "link": "https://steppingstonescri.net/stepping-stones-attends-the-wilson-nc-recovery-rally/",
    "excerpt": "On Saturday, September 10, 2016, Stepping Stones Community Resources, Inc. attended the Wilson NC, Recovery Rally to show support for those battling alcohol and drug dependence.\nhttp://www.wilsontimes.com/stories/Allies-against-addiction,72692",
    "date": "2016-09-12T16:44:27",
    "categories": [
      7
    ],
    "content": "<p><strong>On Saturday, September 10, 2016, Stepping Stones Community Resources, Inc. attended the Wilson NC, Recovery Rally to show support for those battling alcohol and drug dependence.</strong></p>\n<p><a href=\"http://www.wilsontimes.com/stories/Allies-against-addiction,72692\">http://www.wilsontimes.com/</a><a href=\"http://www.wilsontimes.com/stories/Allies-against-addiction,72692\">stories/Allies-against-addiction,72692</a></p>\n<p><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/1473640208_0585.jpg\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-10316 alignleft\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/1473640208_0585-300x200.jpg\" alt=\"1473640208_0585\" width=\"121\" height=\"81\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2016/09/1473640208_0585-300x200.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2016/09/1473640208_0585-768x512.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2016/09/1473640208_0585.jpg 1024w\" sizes=\"auto, (max-width: 121px) 100vw, 121px\" /></a></p>\n<p><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/IMG_2146.jpg\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-10327 alignleft\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/IMG_2146-300x225.jpg\" alt=\"img_2146\" width=\"111\" height=\"83\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2146-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2146-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2146-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 111px) 100vw, 111px\" /></a></p>\n<p><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/IMG_2146.jpg\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-10327 alignleft\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/IMG_2146-300x225.jpg\" alt=\"img_2146\" width=\"111\" height=\"83\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2146-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2146-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2146-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 111px) 100vw, 111px\" /></a></p>\n<p><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/IMG_2134.jpg\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-10324 alignleft\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/IMG_2134-300x225.jpg\" alt=\"img_2134\" width=\"112\" height=\"84\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2134-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2134-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2134-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 112px) 100vw, 112px\" /></a></p>\n<p><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/IMG_2112-e1473697373245.jpg\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-10318 alignleft\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/IMG_2112-300x225.jpg\" alt=\"img_2112\" width=\"113\" height=\"85\" /></a></p>\n<p><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/IMG_2129.jpg\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-10322 alignleft\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/IMG_2129-300x225.jpg\" alt=\"img_2129\" width=\"114\" height=\"85\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2129-300x225.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2129-768x576.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2016/09/IMG_2129-1024x768.jpg 1024w\" sizes=\"auto, (max-width: 114px) 100vw, 114px\" /></a></p>\n<p><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/1473640210_51e1.jpg\"><img decoding=\"async\" loading=\"lazy\" class=\" wp-image-10317 alignleft\" src=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/09/1473640210_51e1-300x200.jpg\" alt=\"1473640210_51e1\" width=\"129\" height=\"86\" srcset=\"https://steppingstonescri.net/wp-content/uploads/2016/09/1473640210_51e1-300x200.jpg 300w, https://steppingstonescri.net/wp-content/uploads/2016/09/1473640210_51e1-768x512.jpg 768w, https://steppingstonescri.net/wp-content/uploads/2016/09/1473640210_51e1.jpg 1024w\" sizes=\"auto, (max-width: 129px) 100vw, 129px\" /></a></p>\n"
  },
  {
    "id": 1209,
    "title": "Stepping Stones Community Resources Karlesia Montague has written an article in the field of Mental Health",
    "slug": "stepping-stones-community-resources-karlesia-montague-has-written-an-article-in-the-field-of-mental-health",
    "link": "https://steppingstonescri.net/stepping-stones-community-resources-karlesia-montague-has-written-an-article-in-the-field-of-mental-health/",
    "excerpt": "Press Release Karlesia Montague\nArticle: Counselor Training in Suicide Assessment, Prevention, and Management\n&nbsp;",
    "date": "2016-08-19T19:23:26",
    "categories": [
      7
    ],
    "content": "<p><a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/08/Karlesia-Montague-Press-Release.pdf\">Press Release Karlesia Montague</a></p>\n<p>Article:<em> <a href=\"https://steppingstonescri.net/2016/wp-content/uploads/2016/08/article_65d15528f16116603abcacff0000bee5e7.pdf\">Counselor Training in Suicide Assessment, Prevention, and Management</a></em></p>\n<div class=\"callout-wrap\"><span><strong>Stepping Stones Community Resources, Inc. is proud to announce a highly regarded member of their staff, Karlesia Montague, MS, LPC-A, LCAS-A, NCC, Licensed Clinician, has co-authored her first article in the field of Mental Health, citing Suicide, a frequent crisis. Karlesia strengthens Stepping Stones with her knowledge and expertise in Suicide Assessment and Counseling.</strong> <strong style=\"line-height: 1.6em;\"> </strong><span style=\"line-height: 1.6em;\"></span></div>\n<p><!-- END callout-wrap --><br class=\"clear\" /><br />\n</span></p>\n<p>&nbsp;</p>\n"
  },
  {
    "id": 958,
    "title": "Stepping Stones Community Resources DWI Services",
    "slug": "stepping-stones-community-resources-dwi-services",
    "link": "https://steppingstonescri.net/stepping-stones-community-resources-dwi-services/",
    "excerpt": "We now offer a full array of DWI Services in our Wilson Office covering all of Wilson County and our Kinston office covering all of Lenior County. &nbsp; This includes Assessments, Alcohol and Drug Education Traffic School, Long and Short Term Treatment, Substance Abuse Intensive Outpatient Program and Out-of-State Reviews.",
    "date": "2016-06-22T21:33:37",
    "categories": [
      7
    ],
    "content": "<div class=\"callout-wrap\"><span><strong>We now offer a full array of DWI Services in our Wilson Office covering all of Wilson County and our Kinston office covering all of Lenior County.</strong></p>\n<p>&nbsp;</p>\n<p><strong>This includes Assessments, Alcohol and Drug Education Traffic School, Long and Short Term Treatment, Substance Abuse Intensive Outpatient Program and Out-of-State Reviews. </strong></span></div>\n<p><!-- END callout-wrap --><br class=\"clear\" /></p>\n"
  }
]